liangchao1992/ucore/ucore/src/kern-ucore/arch/arm/m3/mb9b500r.h
typedef struct stc_wc_wccr_field
{
  __IO  uint8_t WCIF       : 1;
  __IO  uint8_t WCIE       : 1;
  __IO  uint8_t CS0        : 1;
  __IO  uint8_t CS1        : 1;
        uint8_t RESERVED1  : 2;
  __IO  uint8_t WCOP       : 1;
  __IO  uint8_t WCEN       : 1;
} stc_wc_wccr_field_t;

typedef struct stc_wc_clk_sel_field
{
  __IO uint16_t SEL_IN     : 1;
       uint16_t RESERVED1  : 7;
  __IO uint16_t SEL_OUT    : 1;
} stc_wc_clk_sel_field_t;

typedef struct stc_wc_clk_en_field
{
  __IO  uint8_t CLK_EN     : 1;
  __IO  uint8_t CLK_EN_R   : 1;
} stc_wc_clk_en_field_t;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* EXBUS_MODULE register bit fields */
typedef struct stc_exbus_mode0_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode0_field_t;

typedef struct stc_exbus_mode1_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode1_field_t;

typedef struct stc_exbus_mode2_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode2_field_t;

typedef struct stc_exbus_mode3_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode3_field_t;

typedef struct stc_exbus_mode4_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode4_field_t;

typedef struct stc_exbus_mode5_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode5_field_t;

typedef struct stc_exbus_mode6_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode6_field_t;

typedef struct stc_exbus_mode7_field
{
  __IO uint32_t WDTH0      : 1;
  __IO uint32_t WDTH1      : 1;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t TEST       : 1;
} stc_exbus_mode7_field_t;

typedef struct stc_exbus_tim0_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim0_field_t;

typedef struct stc_exbus_tim1_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim1_field_t;

typedef struct stc_exbus_tim2_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim2_field_t;

typedef struct stc_exbus_tim3_field
{
  __IO uint32_t RACC0      : 1;
  __IO uint32_t RACC1      : 1;
  __IO uint32_t RACC2      : 1;
  __IO uint32_t RACC3      : 1;
  __IO uint32_t RADC0      : 1;
  __IO uint32_t RADC1      : 1;
  __IO uint32_t RADC2      : 1;
  __IO uint32_t RADC3      : 1;
  __IO uint32_t FRADC0     : 1;
  __IO uint32_t FRADC1     : 1;
  __IO uint32_t FRADC2     : 1;
  __IO uint32_t FRADC3     : 1;
  __IO uint32_t RIDLC0     : 1;
  __IO uint32_t RIDLC1     : 1;
  __IO uint32_t RIDLC2     : 1;
  __IO uint32_t RIDLC3     : 1;
  __IO uint32_t WACC0      : 1;
  __IO uint32_t WACC1      : 1;
  __IO uint32_t WACC2      : 1;
  __IO uint32_t WACC3      : 1;
  __IO uint32_t WADC0      : 1;
  __IO uint32_t WADC1      : 1;
  __IO uint32_t WADC2      : 1;
  __IO uint32_t WADC3      : 1;
  __IO uint32_t WWEC0      : 1;
  __IO uint32_t WWEC1      : 1;
  __IO uint32_t WWEC2      : 1;
  __IO uint32_t WWEC3      : 1;
  __IO uint32_t WIDLC0     : 1;
  __IO uint32_t WIDLC1     : 1;
  __IO uint32_t WIDLC2     : 1;
  __IO uint32_t WIDLC3     : 1;
} stc_exbus_tim3_field_t;

